piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
/**
 ******************************************************************************
 * @file    MDR32F21QI.h
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    26/05/2023
 * @brief   CMSIS Device Peripheral Access Layer Header File for MDR32F21QI.
 ******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F21QI_H
#define __MDR32F21QI_H

/** @addtogroup CMSIS CMSIS
 * @{
 */

/** @addtogroup MDR32F21QI MDR32F21QI
 * @{
 */

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/** @defgroup MDR32F21QI_Configuration_of_CMSIS MDR32F21QI Configuration of CMSIS
 * @{
 */

#define __CM0_REV              0U /*!< Core Revision */
#define __NVIC_PRIO_BITS       2U /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig 0U /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* End of group MDR32F21QI_Configuration_of_CMSIS */

/** @defgroup MDR32F21QI_Peripheral MDR32F21QI Peripheral
 * @{
 */

/**
 * @brief MDR32F21QI Interrupt Number Definition
 */
typedef enum IRQn {
    /* ARM Cortex-M0 Specific Interrupt Numbers */
    Reset_IRQn          = -15, /*!< -15 Reset Vector, invoked on Power up and warm reset */
    NonMaskableInt_IRQn = -14, /*!< -14 Non maskable Interrupt, cannot be stopped or preempted */
    HardFault_IRQn      = -13, /*!< -13 Hard Fault, all classes of Fault */
    SVCall_IRQn         = -5,  /*!< -5 System Service Call via SVC instruction */
    PendSV_IRQn         = -2,  /*!< -2 Pendable request for system service */
    SysTick_IRQn        = -1,  /*!< -1 System Tick Timer */
    /* MDR32F21QI Specific Interrupt Numbers */
    DMA_IRQn      = 0,  /*!< DMA Interrupt */
    UART0_IRQn    = 1,  /*!< UART0 Interrupt */
    UART1_IRQn    = 2,  /*!< UART1 Interrupt */
    SSP_IRQn      = 3,  /*!< SSP Interrupt */
    POWER_IRQn    = 4,  /*!< POWER Interrupt */
    WWDG_IRQn     = 5,  /*!< WWDG Interrupt */
    TIMER0_IRQn   = 6,  /*!< TIMER0 Interrupt */
    TIMER1_IRQn   = 7,  /*!< TIMER1 Interrupt */
    ADC_IRQn      = 8,  /*!< ADC Interrupt */
    BKP_RTC_IRQn  = 10, /*!< BKP RTC Interrupt */
    EXT1_IRQn     = 11, /*!< EXT_INT1 Interrupt */
    EXT2_IRQn     = 12, /*!< EXT_INT2 Interrupt */
    EXT3_IRQn     = 13, /*!< EXT_INT3 Interrupt */
    ADCUI_F0_IRQn = 14, /*!< ADCUI_F0 Interrupt */
    ADCUI_F1_IRQn = 15, /*!< ADCUI_F1 Interrupt */
    ADCUI_F2_IRQn = 16  /*!< ADCUI_F2 Interrupt */
} IRQn_Type;

/* Includes ------------------------------------------------------------------*/
#include "core_cm0.h"
#include "system_MDR32F21QI.h"
#include <stdint.h>

/** @defgroup MDR32F21QI_Peripheral_Exported_types MDR32F21QI Peripheral Exported types
  * @{
  */
typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)       (((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;

#define IS_FUNCTIONAL_STATE(STATE)  (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group MDR32F21QI_Peripheral_Exported_types */

/** @defgroup MDR32F21QI_Peripheral_Units MDR32F21QI Peripheral Units
 * @{
 */

/** @defgroup MDR32F21QI_SSP MDR_SSP
 * @{
 */

/**
 * @brief MDR32F21QI SSP control structure
 */
typedef struct {
    __IO uint32_t CR0;   /*!<SSP Control0 Register */
    __IO uint32_t CR1;   /*!<SSP Control1 Register */
    __IO uint32_t DR;    /*!<SSP Data Register */
    __IO uint32_t SR;    /*!<SSP Status Register */
    __IO uint32_t CPSR;  /*!<SSP Clock Prescaler Register */
    __IO uint32_t IMSC;  /*!<SSP Interrupt Mask Register */
    __IO uint32_t RIS;   /*!<SSP Interrupt Pending Register */
    __IO uint32_t MIS;   /*!<SSP Masked Interrupt Pending Register */
    __IO uint32_t ICR;   /*!<SSP Interrupt Clear Register */
    __IO uint32_t DMACR; /*!<SSP DMA Control Register */
} MDR_SSP_TypeDef;

/** @defgroup MDR32F21QI_SSP_Defines SSP Defines
 * @{
 */

/** @defgroup MDR32F21QI_SSP_CR0 SSP_CR0
 * @{
 */

#define SSP_CR0_DSS_Pos       0
#define SSP_CR0_DSS_Msk       (0xFUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_4BIT      (0x3UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_5BIT      (0x4UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_6BIT      (0x5UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_7BIT      (0x6UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_8BIT      (0x7UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_9BIT      (0x8UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_10BIT     (0x9UL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_11BIT     (0xAUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_12BIT     (0xBUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_13BIT     (0xCUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_14BIT     (0xDUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_15BIT     (0xEUL << SSP_CR0_DSS_Pos)
#define SSP_CR0_DSS_16BIT     (0xFUL << SSP_CR0_DSS_Pos)

#define SSP_CR0_FRF_Pos       4
#define SSP_CR0_FRF_Msk       (0x3UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_SPI       (0x0UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_SSI       (0x1UL << SSP_CR0_FRF_Pos)
#define SSP_CR0_FRF_MICROWIRE (0x2UL << SSP_CR0_FRF_Pos)

#define SSP_CR0_SPO_Pos       6
#define SSP_CR0_SPO_Msk       (0x1UL << SSP_CR0_SPO_Pos)
#define SSP_CR0_SPO           SSP_CR0_SPO_Msk

#define SSP_CR0_SPH_Pos       7
#define SSP_CR0_SPH_Msk       (0x1UL << SSP_CR0_SPH_Pos)
#define SSP_CR0_SPH           SSP_CR0_SPH_Msk

#define SSP_CR0_SCR_Pos       8
#define SSP_CR0_SCR_Msk       (0xFFUL << SSP_CR0_SCR_Pos)

/** @} */ /* End of group MDR32F21QI_SSP_CR0 */

