piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
/** @defgroup MDR32F21QI_ADCUI_FxCTR ADCUI_FxCTR
 * @{
 */

#define ADCUI_FxCTR_FxI0NTEN_Pos  0
#define ADCUI_FxCTR_FxI0NTEN_Msk  (0x1UL << ADCUI_FxCTR_FxI0NTEN_Pos)
#define ADCUI_FxCTR_FxI0NTEN      ADCUI_FxCTR_FxI0NTEN_Msk

#define ADCUI_FxCTR_FxI3NTEN_Pos  1
#define ADCUI_FxCTR_FxI3NTEN_Msk  (0x1UL << ADCUI_FxCTR_FxI3NTEN_Pos)
#define ADCUI_FxCTR_FxI3NTEN      ADCUI_FxCTR_FxI3NTEN_Msk

#define ADCUI_FxCTR_FxVASEL_Pos   2
#define ADCUI_FxCTR_FxVASEL_Msk   (0x1UL << ADCUI_FxCTR_FxVASEL_Pos)
#define ADCUI_FxCTR_FxVASEL       ADCUI_FxCTR_FxVASEL_Msk

#define ADCUI_FxCTR_FxRARS_Pos    3
#define ADCUI_FxCTR_FxRARS_Msk    (0x1UL << ADCUI_FxCTR_FxRARS_Pos)
#define ADCUI_FxCTR_FxRARS        ADCUI_FxCTR_FxRARS_Msk

#define ADCUI_FxCTR_FxRRRS_Pos    4
#define ADCUI_FxCTR_FxRRRS_Msk    (0x1UL << ADCUI_FxCTR_FxRRRS_Pos)
#define ADCUI_FxCTR_FxRRRS        ADCUI_FxCTR_FxRRRS_Msk

#define ADCUI_FxCTR_FxRVRS_Pos    5
#define ADCUI_FxCTR_FxRVRS_Msk    (0x1UL << ADCUI_FxCTR_FxRVRS_Pos)
#define ADCUI_FxCTR_FxRVRS        ADCUI_FxCTR_FxRVRS_Msk

#define ADCUI_FxCTR_FxIGAIN_Pos   6
#define ADCUI_FxCTR_FxI0GAIN_Msk  (0x3UL << ADCUI_FxCTR_FxIGAIN_Pos)
#define ADCUI_FxCTR_FxI0GAIN_0dB  (0x0UL << ADCUI_FxCTR_FxIGAIN_Pos)
#define ADCUI_FxCTR_FxI0GAIN_6dB  (0x1UL << ADCUI_FxCTR_FxIGAIN_Pos)
#define ADCUI_FxCTR_FxI0GAIN_12dB (0x2UL << ADCUI_FxCTR_FxIGAIN_Pos)
#define ADCUI_FxCTR_FxI0GAIN_18dB (0x3UL << ADCUI_FxCTR_FxIGAIN_Pos)

#define ADCUI_FxCTR_FxVGAIN_Pos   8
#define ADCUI_FxCTR_FxVGAIN_Msk   (0x3UL << ADCUI_FxCTR_FxVGAIN_Pos)
#define ADCUI_FxCTR_FxVGAIN_0dB   (0x0UL << ADCUI_FxCTR_FxVGAIN_Pos)
#define ADCUI_FxCTR_FxVGAIN_6dB   (0x1UL << ADCUI_FxCTR_FxVGAIN_Pos)
#define ADCUI_FxCTR_FxVGAIN_12dB  (0x2UL << ADCUI_FxCTR_FxVGAIN_Pos)
#define ADCUI_FxCTR_FxVGAIN_18dB  (0x3UL << ADCUI_FxCTR_FxVGAIN_Pos)

#define ADCUI_FxCTR_FxVPHASE_Pos  10
#define ADCUI_FxCTR_FxVPHASE_Msk  (0xFFUL << ADCUI_FxCTR_FxVPHASE_Pos)

#define ADCUI_FxCTR_FxI3GAIN_Pos  18
#define ADCUI_FxCTR_FxI3GAIN_Msk  (0x3UL << ADCUI_FxCTR_FxI3GAIN_Pos)
#define ADCUI_FxCTR_FxI3GAIN_0dB  (0x0UL << ADCUI_FxCTR_FxI3GAIN_Pos)
#define ADCUI_FxCTR_FxI3GAIN_6dB  (0x1UL << ADCUI_FxCTR_FxI3GAIN_Pos)
#define ADCUI_FxCTR_FxI3GAIN_12dB (0x2UL << ADCUI_FxCTR_FxI3GAIN_Pos)
#define ADCUI_FxCTR_FxI3GAIN_18dB (0x3UL << ADCUI_FxCTR_FxI3GAIN_Pos)

#define ADCUI_FxCTR_FxIRMSOS_Pos  20
#define ADCUI_FxCTR_FxIRMSOS_Msk  (0xFFFUL << ADCUI_FxCTR_FxIRMSOS_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxCTR */

/** @defgroup MDR32F21QI_ADCUI_FxWC ADCUI_FxWC
 * @{
 */

#define ADCUI_FxWC_FxWATTOS_Pos 0
#define ADCUI_FxWC_FxWATTOS_Msk (0xFFFFUL << ADCUI_FxWC_FxWATTOS_Pos)

#define ADCUI_FxWC_FxWGAIN_Pos  16
#define ADCUI_FxWC_FxWGAIN_Msk  (0xFFFUL << ADCUI_FxWC_FxWGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxWC */

/** @defgroup MDR32F21QI_ADCUI_FxWATTP ADCUI_FxWATTP
 * @{
 */

#define ADCUI_FxWATTP_FxWATTHRP_Pos 0
#define ADCUI_FxWATTP_FxWATTHRP_Msk (0xFFFFFFFFUL << ADCUI_FxWATTP_FxWATTHRP_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxWATTP */

/** @defgroup MDR32F21QI_ADCUI_FxWATTN ADCUI_FxWATTN
 * @{
 */

#define ADCUI_FxWATTN_FxWATTHRN_Pos 0
#define ADCUI_FxWATTN_FxWATTHRN_Msk (0xFFFFFFFFUL << ADCUI_FxWATTN_FxWATTHRN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxWATTN */

/** @defgroup MDR32F21QI_ADCUI_FxVC ADCUI_FxVC
 * @{
 */

#define ADCUI_FxVC_FxVAROS_Pos   0
#define ADCUI_FxVC_FxVAROS_Msk   (0xFFFFUL << ADCUI_FxVC_FxVAROS_Pos)

#define ADCUI_FxVC_FxVARGAIN_Pos 16
#define ADCUI_FxVC_FxVARGAIN_Msk (0xFFFUL << ADCUI_FxVC_FxVARGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVC */

/** @defgroup MDR32F21QI_ADCUI_FxVARP ADCUI_FxVARP
 * @{
 */

#define ADCUI_FxVARP_FxVARHRP_Pos 0
#define ADCUI_FxVARP_FxVARHRP_Msk (0xFFFFFFFFUL << ADCUI_FxVARP_FxVARHRP_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVARP */

/** @defgroup MDR32F21QI_ADCUI_FxVARN ADCUI_FxVARN
 * @{
 */

#define ADCUI_FxVARN_FxVARHRN_Pos 0
#define ADCUI_FxVARN_FxVARHRN_Msk (0xFFFFFFFFUL << ADCUI_FxVARN_FxVARHRN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVARN */

/** @defgroup MDR32F21QI_ADCUI_FxAC ADCUI_FxAC
 * @{
 */

#define ADCUI_FxAC_FxVRMSOS_Pos 0
#define ADCUI_FxAC_FxVRMSOS_Msk (0xFFFUL << ADCUI_FxAС_FxVRMSOS_Pos)

#define ADCUI_FxAC_FxVAGAIN_Pos 16
#define ADCUI_FxAC_FxVAGAIN_Msk (0xFFFUL << ADCUI_FxAC_FxVAGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxAC */

/** @defgroup MDR32F21QI_ADCUI_FxVR ADCUI_FxVR
 * @{
 */

#define ADCUI_FxVR_FxVAHR_Pos 0
#define ADCUI_FxVR_FxVAHR_Msk (0xFFFFFFFFUL << ADCUI_FxVR_FxVAHR_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVR */

/** @defgroup MDR32F21QI_ADCUI_FxMD0 ADCUI_FxMD0
 * @{
 */

#define ADCUI_FxMD0_FxVSEL_Pos           0
#define ADCUI_FxMD0_FxVSEL_Msk           (0x3UL << ADCUI_FxMD0_FxVSEL_Pos)
#define ADCUI_FxMD0_FxVSEL_V             (0x0UL << ADCUI_FxMD0_FxVSEL_Pos)
#define ADCUI_FxMD0_FxVSEL_ACTIVEPOWER   (0x1UL << ADCUI_FxMD0_FxVSEL_Pos)
#define ADCUI_FxMD0_FxVSEL_REACTIVEPOWER (0x2UL << ADCUI_FxMD0_FxVSEL_Pos)
#define ADCUI_FxMD0_FxVSEL_FULLPOWER     (0x3UL << ADCUI_FxMD0_FxVSEL_Pos)

#define ADCUI_FxMD0_FxISEL_Pos           2
#define ADCUI_FxMD0_FxISEL_Msk           (0x3UL << ADCUI_FxMD0_FxISEL_Pos)
#define ADCUI_FxMD0_FxISEL_I             (0x0UL << ADCUI_FxMD0_FxISEL_Pos)
#define ADCUI_FxMD0_FxISEL_ACTIVEPOWER   (0x1UL << ADCUI_FxMD0_FxISEL_Pos)
#define ADCUI_FxMD0_FxISEL_REACTIVEPOWER (0x2UL << ADCUI_FxMD0_FxISEL_Pos)
#define ADCUI_FxMD0_FxISEL_FULLPOWER     (0x3UL << ADCUI_FxMD0_FxISEL_Pos)

#define ADCUI_FxMD0_FxACTS_Pos           4
#define ADCUI_FxMD0_FxACTS_Msk           (0x1UL << ADCUI_FxMD0_FxACTS_Pos)
#define ADCUI_FxMD0_FxACTS               ADCUI_FxMD0_FxACTS_Msk

#define ADCUI_FxMD0_FxREACTS_Pos         5
#define ADCUI_FxMD0_FxREACTS_Msk         (0x1UL << ADCUI_FxMD0_FxREACTS_Pos)
#define ADCUI_FxMD0_FxREACTS             ADCUI_FxMD0_FxREACTS_Msk

#define ADCUI_FxMD0_IxGAIN_Pos           6
#define ADCUI_FxMD0_IxGAIN_Msk           (0x1UL << ADCUI_FxMD0_IxGAIN_Pos)
#define ADCUI_FxMD0_IxGAIN               ADCUI_FxMD0_IxGAIN_Msk

