piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
#define ADCUI_FxMD0_VxGAIN_Pos           7
#define ADCUI_FxMD0_VxGAIN_Msk           (0x1UL << ADCUI_FxMD0_VxGAIN_Pos)
#define ADCUI_FxMD0_VxGAIN               ADCUI_FxMD0_VxGAIN_Msk

#define ADCUI_FxMD0_I3GAIN_Pos           8
#define ADCUI_FxMD0_I3GAIN_Msk           (0x1UL << ADCUI_FxMD0_I3GAIN_Pos)
#define ADCUI_FxMD0_I3GAIN               ADCUI_FxMD0_I3GAIN_Msk

#define ADCUI_FxMD0_FxPER_FREQ_Pos       12
#define ADCUI_FxMD0_FxPER_FREQ_Msk       (0x1FFFFUL << ADCUI_FxMD0_FxPER_FREQ_Pos)

#define ADCUI_FxMD0_FxI3SEL_Pos          29
#define ADCUI_FxMD0_FxI3SEL_Msk          (0x1UL << ADCUI_FxMD0_FxI3SEL_Pos)
#define ADCUI_FxMD0_FxI3SEL              ADCUI_FxMD0_FxI3SEL_Msk

#define ADCUI_FxMD0_FxSEL_I_CH_Pos       30
#define ADCUI_FxMD0_FxSEL_I_CH_Msk       (0x3UL << ADCUI_FxMD0_FxSEL_I_CH_Pos)
#define ADCUI_FxMD0_FxSEL_I_CH_AUTO      (0x0UL << ADCUI_FxMD0_FxSEL_I_CH_Pos)
#define ADCUI_FxMD0_FxSEL_I_CH_ACTIVEI0  (0x1UL << ADCUI_FxMD0_FxSEL_I_CH_Pos)
#define ADCUI_FxMD0_FxSEL_I_CH_ACTIVEI3  (0x2UL << ADCUI_FxMD0_FxSEL_I_CH_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxMD0 */

/** @defgroup MDR32F21QI_ADCUI_FxMD1 ADCUI_FxMD1
 * @{
 */

#define ADCUI_FxMD1_FxIPKLVL_Pos 0
#define ADCUI_FxMD1_FxIPKLVL_Msk (0xFFFFUL << ADCUI_FxMD1_FxIPKLVL_Pos)

#define ADCUI_FxMD1_FxVPKLVL_Pos 16
#define ADCUI_FxMD1_FxVPKLVL_Msk (0xFFFFUL << ADCUI_FxMD1_FxVPKLVL_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxMD1 */

/** @defgroup MDR32F21QI_ADCUI_FxVPEAK ADCUI_FxVPEAK
 * @{
 */

#define ADCUI_FxVPEAK_FxVPEAK_Pos 0
#define ADCUI_FxVPEAK_FxVPEAK_Msk (0xFFFFFFUL << ADCUI_FxVPEAK_FxVPEAK_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVPEAK */

/** @defgroup MDR32F21QI_ADCUI_FxIPEAK ADCUI_FxIPEAK
 * @{
 */

#define ADCUI_FxIPEAK_FxIPEAK_Pos 0
#define ADCUI_FxIPEAK_FxIPEAK_Msk (0xFFFFFFUL << ADCUI_FxIPEAK_FxIPEAK_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxIPEAK */

/** @defgroup MDR32F21QI_ADCUI_FxVDAT ADCUI_FxVDAT
 * @{
 */

#define ADCUI_FxVDAT_FxVDAT_Pos 0
#define ADCUI_FxVDAT_FxVDAT_Msk (0xFFFFFFUL << ADCUI_FxVDAT_FxVDAT_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVDAT */

/** @defgroup MDR32F21QI_ADCUI_FxI0DAT ADCUI_FxI0DAT
 * @{
 */

#define ADCUI_FxI0DAT_FxI0DAT_Pos 0
#define ADCUI_FxI0DAT_FxI0DAT_Msk (0xFFFFFFUL << ADCUI_FxI0DAT_FxI0DAT_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxI0DAT */

/** @defgroup MDR32F21QI_ADCUI_FxI3DAT ADCUI_FxI3DAT
 * @{
 */

#define ADCUI_FxI3DAT_FxI3DAT_Pos 0
#define ADCUI_FxI3DAT_FxI3DAT_Msk (0xFFFFFFUL << ADCUI_FxI3DAT_FxI3DAT_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxI3DAT */

/** @defgroup MDR32F21QI_ADCUI_FxVRMS ADCUI_FxVRMS
 * @{
 */

#define ADCUI_FxVRMS_FxVRMS_Pos 0
#define ADCUI_FxVRMS_FxVRMS_Msk (0xFFFFFFUL << ADCUI_FxVRMS_FxVRMS_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVRMS */

/** @defgroup MDR32F21QI_ADCUI_FxVRMS2 ADCUI_FxVRMS2
 * @{
 */

#define ADCUI_FxVRMS2_FxVRMS2_Pos 0
#define ADCUI_FxVRMS2_FxVRMS2_Msk (0xFFFFFFFFUL << ADCUI_FxVRMS2_FxVRMS2_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxVRMS2 */

/** @defgroup MDR32F21QI_ADCUI_FxIRMS ADCUI_FxIRMS
 * @{
 */

#define ADCUI_FxIRMS_FxIRMS_Pos 0
#define ADCUI_FxIRMS_FxIRMS_Msk (0xFFFFFFUL << ADCUI_FxIRMS_FxIRMS_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxIRMS */

/** @defgroup MDR32F21QI_ADCUI_FxIRMS2 ADCUI_FxIRMS2
 * @{
 */

#define ADCUI_FxIRMS2_FxIRMS2_Pos 0
#define ADCUI_FxIRMS2_FxIRMS2_Msk (0xFFFFFFFFUL << ADCUI_FxIRMS2_FxIRMS2_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_FxIRMS2 */

/** @defgroup MDR32F21QI_ADCUI_FxSTAT ADCUI_FxSTAT
 * @{
 */

#define ADCUI_FxSTAT_FxVF_EMP_Pos   0
#define ADCUI_FxSTAT_FxVF_EMP_Msk   (0x1UL << ADCUI_FxSTAT_FxVF_EMP_Pos)
#define ADCUI_FxSTAT_FxVF_EMP       ADCUI_FxSTAT_FxVF_EMP_Msk

#define ADCUI_FxSTAT_FxVF_FLL_Pos   1
#define ADCUI_FxSTAT_FxVF_FLL_Msk   (0x1UL << ADCUI_FxSTAT_FxVF_FLL_Pos)
#define ADCUI_FxSTAT_FxVF_FLL       ADCUI_FxSTAT_FxVF_FLL_Msk

#define ADCUI_FxSTAT_FxVF_OVR_Pos   2
#define ADCUI_FxSTAT_FxVF_OVR_Msk   (0x1UL << ADCUI_FxSTAT_FxVF_OVR_Pos)
#define ADCUI_FxSTAT_FxVF_OVR       ADCUI_FxSTAT_FxVF_OVR_Msk

#define ADCUI_FxSTAT_FxIF_EMP_Pos   3
#define ADCUI_FxSTAT_FxIF_EMP_Msk   (0x1UL << ADCUI_FxSTAT_FxIF_EMP_Pos)
#define ADCUI_FxSTAT_FxIF_EMP       ADCUI_FxSTAT_FxIF_EMP_Msk

#define ADCUI_FxSTAT_FxIF_FLL_Pos   4
#define ADCUI_FxSTAT_FxIF_FLL_Msk   (0x1UL << ADCUI_FxSTAT_FxIF_FLL_Pos)
#define ADCUI_FxSTAT_FxIF_FLL       ADCUI_FxSTAT_FxIF_FLL_Msk

#define ADCUI_FxSTAT_FxIF_OVR_Pos   5
#define ADCUI_FxSTAT_FxIF_OVR_Msk   (0x1UL << ADCUI_FxSTAT_FxIF_OVR_Pos)
#define ADCUI_FxSTAT_FxIF_OVR       ADCUI_FxSTAT_FxIF_OVR_Msk

#define ADCUI_FxSTAT_FxSAGF_Pos     6
#define ADCUI_FxSTAT_FxSAGF_Msk     (0x1UL << ADCUI_FxSTAT_FxSAGF_Pos)
#define ADCUI_FxSTAT_FxSAGF         ADCUI_FxSTAT_FxSAGF_Msk

#define ADCUI_FxSTAT_FxPEAKVF_Pos   7
#define ADCUI_FxSTAT_FxPEAKVF_Msk   (0x1UL << ADCUI_FxSTAT_FxPEAKVF_Pos)
#define ADCUI_FxSTAT_FxPEAKVF       ADCUI_FxSTAT_FxPEAKVF_Msk

#define ADCUI_FxSTAT_FxPEAKIF_Pos   8
#define ADCUI_FxSTAT_FxPEAKIF_Msk   (0x1UL << ADCUI_FxSTAT_FxPEAKIF_Pos)
#define ADCUI_FxSTAT_FxPEAKIF       ADCUI_FxSTAT_FxPEAKIF_Msk

#define ADCUI_FxSTAT_FxWATTOVP_Pos  9
#define ADCUI_FxSTAT_FxWATTOVP_Msk  (0x1UL << ADCUI_FxSTAT_FxWATTOVP_Pos)
#define ADCUI_FxSTAT_FxWATTOVP      ADCUI_FxSTAT_FxWATTOVP_Msk

#define ADCUI_FxSTAT_FxVAROVP_Pos   10
#define ADCUI_FxSTAT_FxVAROVP_Msk   (0x1UL << ADCUI_FxSTAT_FxVAROVP_Pos)
#define ADCUI_FxSTAT_FxVAROVP       ADCUI_FxSTAT_FxVAROVP_Msk

#define ADCUI_FxSTAT_FxVAOV_Pos     11
#define ADCUI_FxSTAT_FxVAOV_Msk     (0x1UL << ADCUI_FxSTAT_FxVAOV_Pos)
#define ADCUI_FxSTAT_FxVAOV         ADCUI_FxSTAT_FxVAOV_Msk

#define ADCUI_FxSTAT_FxZXTOF_Pos    12
#define ADCUI_FxSTAT_FxZXTOF_Msk    (0x1UL << ADCUI_FxSTAT_FxZXTOF_Pos)
#define ADCUI_FxSTAT_FxZXTOF        ADCUI_FxSTAT_FxZXTOF_Msk

#define ADCUI_FxSTAT_FxICHANNEL_Pos 13
#define ADCUI_FxSTAT_FxICHANNEL_Msk (0x1UL << ADCUI_FxSTAT_FxICHANNEL_Pos)
#define ADCUI_FxSTAT_FxICHANNEL     ADCUI_FxSTAT_FxICHANNEL_Msk

#define ADCUI_FxSTAT_FxFAULTCON_Pos 14
#define ADCUI_FxSTAT_FxFAULTCON_Msk (0x1UL << ADCUI_FxSTAT_FxFAULTCON_Pos)
#define ADCUI_FxSTAT_FxFAULTCON     ADCUI_FxSTAT_FxFAULTCON_Msk

#define ADCUI_FxSTAT_FxAPSIGN_Pos   15
#define ADCUI_FxSTAT_FxAPSIGN_Msk   (0x1UL << ADCUI_FxSTAT_FxAPSIGN_Pos)
#define ADCUI_FxSTAT_FxAPSIGN       ADCUI_FxSTAT_FxAPSIGN_Msk

#define ADCUI_FxSTAT_FxAPNLDFL_Pos  16
#define ADCUI_FxSTAT_FxAPNLDFL_Msk  (0x1UL << ADCUI_FxSTAT_FxAPNLDFL_Pos)
#define ADCUI_FxSTAT_FxAPNLDFL      ADCUI_FxSTAT_FxAPNLDFL_Msk

