piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
/** @} */ /* End of group MDR32F21QI_ADCUI_FxMASK */

/** @defgroup MDR32F21QI_ADCUI_CCAL1 ADCUI_CCAL1
 * @{
 */

#define ADCUI_CCAL1_V0BGAIN_Pos 0
#define ADCUI_CCAL1_V0BGAIN_Msk (0xFFFUL << ADCUI_CCAL1_V0BGAIN_Pos)

#define ADCUI_CCAL1_I0BGAIN_Pos 12
#define ADCUI_CCAL1_I0BGAIN_Msk (0xFFFUL << ADCUI_CCAL1_I0BGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_CCAL1 */

/** @defgroup MDR32F21QI_ADCUI_CCAL2 ADCUI_CCAL2
 * @{
 */

#define ADCUI_CCAL2_V1BGAIN_Pos 0
#define ADCUI_CCAL2_V1BGAIN_Msk (0xFFFUL << ADCUI_CCAL2_V1BGAIN_Pos)

#define ADCUI_CCAL2_I1BGAIN_Pos 12
#define ADCUI_CCAL2_I1BGAIN_Msk (0xFFFUL << ADCUI_CCAL2_I1BGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_CCAL2 */

/** @defgroup MDR32F21QI_ADCUI_CCAL3 ADCUI_CCAL3
 * @{
 */

#define ADCUI_CCAL3_V2BGAIN_Pos 0
#define ADCUI_CCAL3_V2BGAIN_Msk (0xFFFUL << ADCUI_CCAL3_V2BGAIN_Pos)

#define ADCUI_CCAL3_I2BGAIN_Pos 12
#define ADCUI_CCAL3_I2BGAIN_Msk (0xFFFUL << ADCUI_CCAL3_I2BGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_CCAL3 */

/** @defgroup MDR32F21QI_ADCUI_CCAL4 ADCUI_CCAL4
 * @{
 */

#define ADCUI_CCAL4_I3BGAIN_Pos 0
#define ADCUI_CCAL4_I3BGAIN_Msk (0xFFFUL << ADCUI_CCAL4_I3BGAIN_Pos)

/** @} */ /* End of group MDR32F21QI_ADCUI_CCAL4 */

/** @} */ /* End of group MDR32F21QI_ADCUI_Defines */

/** @} */ /* End of group MDR32F21QI_ADCUI */

/** @defgroup MDR32F21QI_TIMER MDR_TIMER
 * @{
 */

/**
 * @brief MDR32F21QI TIMER control structure
 */
typedef struct {
    __IO uint32_t CNT;          /*!<TIMER Counter Register */
    __IO uint32_t PSG;          /*!<TIMER Clock Prescaler Register */
    __IO uint32_t ARR;          /*!<TIMER Auto-Reload Register */
    __IO uint32_t CNTRL;        /*!<TIMER Control Register */
    __IO uint32_t CCR1;         /*!<TIMER Capture/Compare Register 1 */
    __IO uint32_t CCR2;         /*!<TIMER Capture/Compare Register 2 */
    __IO uint32_t CCR3;         /*!<TIMER Capture/Compare Register 3 */
    __IO uint32_t CCR4;         /*!<TIMER Capture/Compare Register 4 */
    __IO uint32_t CH1_CNTRL;    /*!<TIMER Channel 1 Control Register */
    __IO uint32_t CH2_CNTRL;    /*!<TIMER Channel 2 Control Register */
    __IO uint32_t CH3_CNTRL;    /*!<TIMER Channel 3 Control Register */
    __IO uint32_t CH4_CNTRL;    /*!<TIMER Channel 4 Control Register */
    __IO uint32_t CH1_CNTRL1;   /*!<TIMER Channel 1 Control1 Register */
    __IO uint32_t CH2_CNTRL1;   /*!<TIMER Channel 2 Control1 Register */
    __IO uint32_t CH3_CNTRL1;   /*!<TIMER Channel 3 Control1 Register */
    __IO uint32_t CH4_CNTRL1;   /*!<TIMER Channel 4 Control1 Register */
    __IO uint32_t CH1_DTG;      /*!<TIMER Channel 1 DTG Register */
    __IO uint32_t CH2_DTG;      /*!<TIMER Channel 2 DTG Register */
    __IO uint32_t CH3_DTG;      /*!<TIMER Channel 3 DTG Register */
    __IO uint32_t CH4_DTG;      /*!<TIMER Channel 4 DTG Register */
    __IO uint32_t BRKETR_CNTRL; /*!<TIMER BRK/ETR Control Register */
    __IO uint32_t STATUS;       /*!<TIMER Status Register */
    __IO uint32_t IE;           /*!<TIMER Interrupt Enable Register */
    __IO uint32_t DMA_RE;       /*!<TIMER DMA Request Enable Register */
    __IO uint32_t CH1_CNTRL2;   /*!<TIMER Channel 1 Control2 Register */
    __IO uint32_t CH2_CNTRL2;   /*!<TIMER Channel 2 Control2 Register */
    __IO uint32_t CH3_CNTRL2;   /*!<TIMER Channel 3 Control2 Register */
    __IO uint32_t CH4_CNTRL2;   /*!<TIMER Channel 4 Control2 Register */
    __IO uint32_t CCR11;        /*!<TIMER Capture/Compare1 Register 1 */
    __IO uint32_t CCR21;        /*!<TIMER Capture/Compare1 Register 2 */
    __IO uint32_t CCR31;        /*!<TIMER Capture/Compare1 Register 3 */
    __IO uint32_t CCR41;        /*!<TIMER Capture/Compare1 Register 4 */
} MDR_TIMER_TypeDef;

/** @defgroup MDR32F21QI_TIMER_Defines TIMER Defines
 * @{
 */

/** @defgroup MDR32F21QI_TIMER_CNT TIMER_CNT
 * @{
 */

#define TIMER_CNT_CNT_Pos 0
#define TIMER_CNT_CNT_Msk (0xFFFFUL << TIMER_CNT_CNT_Pos)

/** @} */ /* End of group MDR32F21QI_TIMER_CNT */

/** @defgroup MDR32F21QI_TIMER_PSG TIMER_PSG
 * @{
 */

#define TIMER_PSG_PSG_Pos 0
#define TIMER_PSG_PSG_Msk (0xFFFFUL << TIMER_PSG_PSG_Pos)

/** @} */ /* End of group MDR32F21QI_TIMER_PSG */

/** @defgroup MDR32F21QI_TIMER_ARR TIMER_ARR
 * @{
 */

#define TIMER_ARR_ARR_Pos 0
#define TIMER_ARR_ARR_Msk (0xFFFFUL << TIMER_ARR_ARR_Pos)

/** @} */ /* End of group MDR32F21QI_TIMER_ARR */

/** @defgroup MDR32F21QI_TIMER_CNTRL TIMER_CNTRL
 * @{
 */

#define TIMER_CNTRL_CNT_EN_Pos              0
#define TIMER_CNTRL_CNT_EN_Msk              (0x1UL << TIMER_CNTRL_CNT_EN_Pos)
#define TIMER_CNTRL_CNT_EN                  TIMER_CNTRL_CNT_EN_Msk

#define TIMER_CNTRL_ARRB_EN_Pos             1
#define TIMER_CNTRL_ARRB_EN_Msk             (0x1UL << TIMER_CNTRL_ARRB_EN_Pos)
#define TIMER_CNTRL_ARRB_EN                 TIMER_CNTRL_ARRB_EN_Msk

#define TIMER_CNTRL_WR_CMPL_Pos             2
#define TIMER_CNTRL_WR_CMPL_Msk             (0x1UL << TIMER_CNTRL_WR_CMPL_Pos)
#define TIMER_CNTRL_WR_CMPL                 TIMER_CNTRL_WR_CMPL_Msk

#define TIMER_CNTRL_DIR_Pos                 3
#define TIMER_CNTRL_DIR_Msk                 (0x1UL << TIMER_CNTRL_DIR_Pos)
#define TIMER_CNTRL_DIR                     TIMER_CNTRL_DIR_Msk

#define TIMER_CNTRL_FDTS_Pos                4
#define TIMER_CNTRL_FDTS_Msk                (0x3UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_1              (0x0UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_2              (0x1UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_3              (0x2UL << TIMER_CNTRL_FDTS_Pos)
#define TIMER_CNTRL_FDTS_DIV_4              (0x3UL << TIMER_CNTRL_FDTS_Pos)

#define TIMER_CNTRL_CNT_MODE_Pos            6
#define TIMER_CNTRL_CNT_MODE_Msk            (0x3UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_FIXED_DIR  (0x0UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_CLK_CHANGE_DIR (0x1UL << TIMER_CNTRL_CNT_MODE_Pos)
#define TIMER_CNTRL_CNT_MODE_EVNT_FIXED_DIR (0x2UL << TIMER_CNTRL_CNT_MODE_Pos)

