piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
#define TIMER_STATUS_CCR_CAP_EVENT_CH4_Pos  8
#define TIMER_STATUS_CCR_CAP_EVENT_CH4_Msk  (0x1UL << TIMER_STATUS_CCR_CAP_EVENT_CH4_Pos)
#define TIMER_STATUS_CCR_CAP_EVENT_CH4      TIMER_STATUS_CCR_CAP_EVENT_CH4_Msk

#define TIMER_STATUS_CCR_REF_EVENT_CH1_Pos  9
#define TIMER_STATUS_CCR_REF_EVENT_CH1_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVENT_CH1_Pos)
#define TIMER_STATUS_CCR_REF_EVENT_CH1      TIMER_STATUS_CCR_REF_EVENT_CH1_Msk

#define TIMER_STATUS_CCR_REF_EVENT_CH2_Pos  10
#define TIMER_STATUS_CCR_REF_EVENT_CH2_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVENT_CH2_Pos)
#define TIMER_STATUS_CCR_REF_EVENT_CH2      TIMER_STATUS_CCR_REF_EVENT_CH2_Msk

#define TIMER_STATUS_CCR_REF_EVENT_CH3_Pos  11
#define TIMER_STATUS_CCR_REF_EVENT_CH3_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVENT_CH3_Pos)
#define TIMER_STATUS_CCR_REF_EVENT_CH3      TIMER_STATUS_CCR_REF_EVENT_CH3_Msk

#define TIMER_STATUS_CCR_REF_EVENT_CH4_Pos  12
#define TIMER_STATUS_CCR_REF_EVENT_CH4_Msk  (0x1UL << TIMER_STATUS_CCR_REF_EVENT_CH4_Pos)
#define TIMER_STATUS_CCR_REF_EVENT_CH4      TIMER_STATUS_CCR_REF_EVENT_CH4_Msk

#define TIMER_STATUS_CCR_CAP1_EVENT_CH1_Pos 13
#define TIMER_STATUS_CCR_CAP1_EVENT_CH1_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVENT_CH1_Pos)
#define TIMER_STATUS_CCR_CAP1_EVENT_CH1     TIMER_STATUS_CCR_CAP1_EVENT_CH1_Msk

#define TIMER_STATUS_CCR_CAP1_EVENT_CH2_Pos 14
#define TIMER_STATUS_CCR_CAP1_EVENT_CH2_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVENT_CH2_Pos)
#define TIMER_STATUS_CCR_CAP1_EVENT_CH2     TIMER_STATUS_CCR_CAP1_EVENT_CH2_Msk

#define TIMER_STATUS_CCR_CAP1_EVENT_CH3_Pos 15
#define TIMER_STATUS_CCR_CAP1_EVENT_CH3_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVENT_CH3_Pos)
#define TIMER_STATUS_CCR_CAP1_EVENT_CH3     TIMER_STATUS_CCR_CAP1_EVENT_CH3_Msk

#define TIMER_STATUS_CCR_CAP1_EVENT_CH4_Pos 16
#define TIMER_STATUS_CCR_CAP1_EVENT_CH4_Msk (0x1UL << TIMER_STATUS_CCR_CAP1_EVENT_CH4_Pos)
#define TIMER_STATUS_CCR_CAP1_EVENT_CH4     TIMER_STATUS_CCR_CAP1_EVENT_CH4_Msk

/** @} */ /* End of group MDR32F21QI_TIMER_STATUS */

/** @defgroup MDR32F21QI_TIMER_IE TIMER_IE
 * @{
 */

#define TIMER_IE_CNT_ZERO_EVENT_IE_Pos     0
#define TIMER_IE_CNT_ZERO_EVENT_IE_Msk     (0x1UL << TIMER_IE_CNT_ZERO_EVENT_IE_Pos)
#define TIMER_IE_CNT_ZERO_EVENT_IE         TIMER_IE_CNT_ZERO_EVENT_IE_Msk

#define TIMER_IE_CNT_ARR_EVENT_IE_Pos      1
#define TIMER_IE_CNT_ARR_EVENT_IE_Msk      (0x1UL << TIMER_IE_CNT_ARR_EVENT_IE_Pos)
#define TIMER_IE_CNT_ARR_EVENT_IE          TIMER_IE_CNT_ARR_EVENT_IE_Msk

#define TIMER_IE_ETR_RE_EVENT_IE_Pos       2
#define TIMER_IE_ETR_RE_EVENT_IE_Msk       (0x1UL << TIMER_IE_ETR_RE_EVENT_IE_Pos)
#define TIMER_IE_ETR_RE_EVENT_IE           TIMER_IE_ETR_RE_EVENT_IE_Msk

#define TIMER_IE_ETR_FE_EVENT_IE_Pos       3
#define TIMER_IE_ETR_FE_EVENT_IE_Msk       (0x1UL << TIMER_IE_ETR_FE_EVENT_IE_Pos)
#define TIMER_IE_ETR_FE_EVENT_IE           TIMER_IE_ETR_FE_EVENT_IE_Msk

#define TIMER_IE_BRK_EVENT_IE_Pos          4
#define TIMER_IE_BRK_EVENT_IE_Msk          (0x1UL << TIMER_IE_BRK_EVENT_IE_Pos)
#define TIMER_IE_BRK_EVENT_IE              TIMER_IE_BRK_EVENT_IE_Msk

#define TIMER_IE_CCR_CAP_EVENT_IE_CH1_Pos  5
#define TIMER_IE_CCR_CAP_EVENT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP_EVENT_IE_CH1      TIMER_IE_CCR_CAP_EVENT_IE_CH1_Msk

#define TIMER_IE_CCR_CAP_EVENT_IE_CH2_Pos  6
#define TIMER_IE_CCR_CAP_EVENT_IE_CH2_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVENT_IE_CH2_Pos)
#define TIMER_IE_CCR_CAP_EVENT_IE_CH2      TIMER_IE_CCR_CAP_EVENT_IE_CH2_Msk

#define TIMER_IE_CCR_CAP_EVENT_IE_CH3_Pos  7
#define TIMER_IE_CCR_CAP_EVENT_IE_CH3_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVENT_IE_CH3_Pos)
#define TIMER_IE_CCR_CAP_EVENT_IE_CH3      TIMER_IE_CCR_CAP_EVENT_IE_CH3_Msk

#define TIMER_IE_CCR_CAP_EVENT_IE_CH4_Pos  8
#define TIMER_IE_CCR_CAP_EVENT_IE_CH4_Msk  (0x1UL << TIMER_IE_CCR_CAP_EVENT_IE_CH4_Pos)
#define TIMER_IE_CCR_CAP_EVENT_IE_CH4      TIMER_IE_CCR_CAP_EVENT_IE_CH4_Msk

#define TIMER_IE_CCR_REF_EVENT_IE_CH1_Pos  9
#define TIMER_IE_CCR_REF_EVENT_IE_CH1_Msk  (0x1UL << TIMER_IE_CCR_REF_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_REF_EVENT_IE_CH1      TIMER_IE_CCR_REF_EVENT_IE_CH1_Msk

#define TIMER_IE_CCR_REF_EVENT_IE_CH2_Pos  10
#define TIMER_IE_CCR_REF_EVENT_IE_CH2_Msk  (0x1UL << TIMER_IE_CCR_REF_EVENT_IE_CH2_Pos)
#define TIMER_IE_CCR_REF_EVENT_IE_CH2      TIMER_IE_CCR_REF_EVENT_IE_CH2_Msk

#define TIMER_IE_CCR_REF_EVENT_IE_CH3_Pos  11
#define TIMER_IE_CCR_REF_EVENT_IE_CH3_Msk  (0x1UL << TIMER_IE_CCR_REF_EVENT_IE_CH3_Pos)
#define TIMER_IE_CCR_REF_EVENT_IE_CH3      TIMER_IE_CCR_REF_EVENT_IE_CH3_Msk

#define TIMER_IE_CCR_REF_EVENT_IE_CH4_Pos  12
#define TIMER_IE_CCR_REF_EVENT_IE_CH4_Msk  (0x1UL << TIMER_IE_CCR_REF_EVENT_IE_CH4_Pos)
#define TIMER_IE_CCR_REF_EVENT_IE_CH4      TIMER_IE_CCR_REF_EVENT_IE_CH4_Msk

#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Pos 13
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Pos)
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH1     TIMER_IE_CCR_CAP1_EVENT_IE_CH1_Msk

#define TIMER_IE_CCR_CAP1_EVENT_IE_CH2_Pos 14
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH2_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVENT_IE_CH2_Pos)
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH2     TIMER_IE_CCR_CAP1_EVENT_IE_CH2_Msk

#define TIMER_IE_CCR_CAP1_EVENT_IE_CH3_Pos 15
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH3_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVENT_IE_CH3_Pos)
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH3     TIMER_IE_CCR_CAP1_EVENT_IE_CH3_Msk

#define TIMER_IE_CCR_CAP1_EVENT_IE_CH4_Pos 16
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH4_Msk (0x1UL << TIMER_IE_CCR_CAP1_EVENT_IE_CH4_Pos)
#define TIMER_IE_CCR_CAP1_EVENT_IE_CH4     TIMER_IE_CCR_CAP1_EVENT_IE_CH4_Msk

/** @} */ /* End of group MDR32F21QI_TIMER_IE */

/** @defgroup MDR32F21QI_TIMER_DMA_RE TIMER_DMA_RE
 * @{
 */

#define TIMER_DMA_RE_CNT_ZERO_EVENT_RE_Pos     0
#define TIMER_DMA_RE_CNT_ZERO_EVENT_RE_Msk     (0x1UL << TIMER_DMA_RE_CNT_ZERO_EVENT_RE_Pos)
#define TIMER_DMA_RE_CNT_ZERO_EVENT_RE         TIMER_DMA_RE_CNT_ZERO_EVENT_RE_Msk

#define TIMER_DMA_RE_CNT_ARR_EVENT_RE_Pos      1
#define TIMER_DMA_RE_CNT_ARR_EVENT_RE_Msk      (0x1UL << TIMER_DMA_RE_CNT_ARR_EVENT_RE_Pos)
#define TIMER_DMA_RE_CNT_ARR_EVENT_RE          TIMER_DMA_RE_CNT_ARR_EVENT_RE_Msk

#define TIMER_DMA_RE_ETR_RE_EVENT_RE_Pos       2
#define TIMER_DMA_RE_ETR_RE_EVENT_RE_Msk       (0x1UL << TIMER_DMA_RE_ETR_RE_EVENT_RE_Pos)
#define TIMER_DMA_RE_ETR_RE_EVENT_RE           TIMER_DMA_RE_ETR_RE_EVENT_RE_Msk

#define TIMER_DMA_RE_ETR_FE_EVENT_RE_Pos       3
#define TIMER_DMA_RE_ETR_FE_EVENT_RE_Msk       (0x1UL << TIMER_DMA_RE_ETR_FE_EVENT_RE_Pos)
#define TIMER_DMA_RE_ETR_FE_EVENT_RE           TIMER_DMA_RE_ETR_FE_EVENT_RE_Msk

