piborisovich/microcontrollers/Milandr/Libraries/CMSIS/MDR32F2xQI/DeviceSupport/MDR32F21QI/inc/MDR32F21QI.h
#define TIMER_DMA_RE_BRK_EVENT_RE_Pos          4
#define TIMER_DMA_RE_BRK_EVENT_RE_Msk          (0x1UL << TIMER_DMA_RE_BRK_EVENT_RE_Pos)
#define TIMER_DMA_RE_BRK_EVENT_RE              TIMER_DMA_RE_BRK_EVENT_RE_Msk

#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH1_Pos  5
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH1_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH1      TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH2_Pos  6
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH2_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH2      TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH3_Pos  7
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH3_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH3      TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH4_Pos  8
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH4_Msk  (0x1UL << TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH4      TIMER_DMA_RE_CCR_CAP_EVENT_RE_CH4_Msk

#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH1_Pos  9
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH1_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVENT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH1      TIMER_DMA_RE_CCR_REF_EVENT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH2_Pos  10
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH2_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVENT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH2      TIMER_DMA_RE_CCR_REF_EVENT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH3_Pos  11
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH3_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVENT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH3      TIMER_DMA_RE_CCR_REF_EVENT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH4_Pos  12
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH4_Msk  (0x1UL << TIMER_DMA_RE_CCR_REF_EVENT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_REF_EVENT_RE_CH4      TIMER_DMA_RE_CCR_REF_EVENT_RE_CH4_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH1_Pos 13
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH1_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH1_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH1     TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH1_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH2_Pos 14
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH2_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH2_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH2     TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH2_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH3_Pos 15
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH3_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH3_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH3     TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH3_Msk

#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH4_Pos 16
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH4_Msk (0x1UL << TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH4_Pos)
#define TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH4     TIMER_DMA_RE_CCR_CAP1_EVENT_RE_CH4_Msk

/** @} */ /* End of group MDR32F21QI_TIMER_DMA_RE */

/** @defgroup MDR32F21QI_TIMER_CH_CNTRL2 TIMER_CH_CNTRL2
 * @{
 */

#define TIMER_CH_CNTRL2_CHSEL_Pos     0
#define TIMER_CH_CNTRL2_CHSEL_Msk     (0x3UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CH_RE   (0x0UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CH_FE   (0x1UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CHp1_FE (0x2UL << TIMER_CH_CNTRL2_CHSEL_Pos)
#define TIMER_CH_CNTRL2_CHSEL_CHp2_FE (0x3UL << TIMER_CH_CNTRL2_CHSEL_Pos)

#define TIMER_CH_CNTRL2_CCR1_EN_Pos   2
#define TIMER_CH_CNTRL2_CCR1_EN_Msk   (0x1UL << TIMER_CH_CNTRL2_CCR1_EN_Pos)
#define TIMER_CH_CNTRL2_CCR1_EN       TIMER_CH_CNTRL2_CCR1_EN_Msk

#define TIMER_CH_CNTRL2_CCRRLD_Pos    3
#define TIMER_CH_CNTRL2_CCRRLD_Msk    (0x1UL << TIMER_CH_CNTRL2_CCRRLD_Pos)
#define TIMER_CH_CNTRL2_CCRRLD        TIMER_CH_CNTRL2_CCRRLD_Msk

/** @} */ /* End of group MDR32F21QI_TIMER_CH_CNTRL2 */

/** @defgroup MDR32F21QI_TIMER_CCR1 TIMER_CCR1
 * @{
 */

#define TIMER_CCR1_CCR1_Pos 0
#define TIMER_CCR1_CCR1_Msk (0xFFFFUL << TIMER_CCR1_CCR1_Pos)

/** @} */ /* End of group MDR32F21QI_TIMER_CCR1 */

/** @} */ /* End of group MDR32F21QI_TIMER_Defines */

/** @} */ /* End of group MDR32F21QI_TIMER */

/** @defgroup MDR32F21QI_PORT MDR_PORT
 * @{
 */

/**
 * @brief MDR32F21QI PORT control structure
 */
typedef struct {
    __IO uint32_t RXTX;   /*!<PORT Data Register */
    __IO uint32_t OE;     /*!<PORT Output Enable Register */
    __IO uint32_t FUNC;   /*!<PORT Function Register */
    __IO uint32_t ANALOG; /*!<PORT Analog Function Register */
    __IO uint32_t PULL;   /*!<PORT Pull Up/Down Register */
    __IO uint32_t PD;     /*!<PORT Driver Mode Register */
    __IO uint32_t PWR;    /*!<PORT Power Register */
    __IO uint32_t GFEN;   /*!<PORT Filter Configuration Register */
    __IO uint32_t SETTX;  /*!<PORT Set Output Register */
    __IO uint32_t CLRTX;  /*!<PORT Reset Output Register */
    __IO uint32_t RDTX;   /*!<PORT Read Output Register */
} MDR_PORT_TypeDef;

/** @defgroup MDR32F21QI_PORT_Defines PORT Defines
 * @{
 */

/** @defgroup MDR32F21QI_PORT_RXTX PORT_RXTX
 * @{
 */

#define PORT_RXTX_RXTX_Pos 0
#define PORT_RXTX_RXTX_Msk (0xFFFFUL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX0    (0x0001UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX1    (0x0002UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX2    (0x0004UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX3    (0x0008UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX4    (0x0010UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX5    (0x0020UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX6    (0x0040UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX7    (0x0080UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX8    (0x0100UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX9    (0x0200UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX10   (0x0400UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX11   (0x0800UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX12   (0x1000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX13   (0x2000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX14   (0x4000UL << PORT_RXTX_RXTX_Pos)
#define PORT_RXTX_RXTX15   (0x8000UL << PORT_RXTX_RXTX_Pos)

/** @} */ /* End of group MDR32F21QI_PORT_RXTX */

/** @defgroup MDR32F21QI_PORT_OE PORT_OE
 * @{
 */

